<?php

	//为运算
	
	//计算机码
	$a = 5;
	$b = -5;
	$c = 10;
	/*
	5原码：00000101
	
	-5原码：10000101
	取反：  11111010   //反码：符号不变，其他位取反
	求补：  11111011   //补码：反码+1
	
	*/
	
	//按位非
	var_dump(~$b);
	/*
		-5 10000101
		补：11111011
		非：00000100
   转换原码：00000100
		
	*/
	
	//按位与操作
	echo '<br/>';
	var_dump($a & $b);
	/*
		取出系统存储的结果进行与操作
		5  00000101
		-5 11111011
		&  00000001  //最终结果
		转换：判断符号位，0表示正数，1表示负数（补码）
		
		
	*/
	echo '<br/>';
	echo decbin($c),'<br/>';
	var_dump($a & $c);
	/*
		5  00000101
		10 00001010
		&  00000000  //最终结果
	*/
	
	//按位左移
	echo '<br/>','a=',$a,'b=',$b,'<br/>';
	var_dump($b>>1);
	
	var_dump($b>>2);
	/*
		-5 11111011
   右移两位 11111110  //运算结果：补码
	   -1  11111101  //反码
	  取反 10000010  //原码
	*/